[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [Compass Demo Account / FrontEnd Servers - Drifted ](https://app.env0.com/p/695bce46-194c-4fc2-a42c-a40f61474310/environments/6fe34b40-ef49-45c9-9e43-1331c080fa19):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-04f5a6a7ecc99fbe2" -> "ami-0bf3fc7dfe888c036" # forces replacement
!       arn                                  = "arn:aws:ec2:us-west-2:326535729404:instance/i-0cd07d46b3d86081f" -> (known after apply)
!       availability_zone                    = "us-west-2a" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
!       id                                   = "i-0cd07d46b3d86081f" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       primary_network_interface_id         = "eni-0ef0d576afc86fb4b" -> (known after apply)
!       private_dns                          = "ip-172-32-21-113.us-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "172.32.21.113" -> (known after apply)
!       public_dns                           = "ec2-54-200-121-69.us-west-2.compute.amazonaws.com" -> (known after apply)
!       public_ip                            = "54.200.121.69" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
!       tags                                 = {
!           "Demo"      = "March 18" -> "April 1"
            "Name"      = "acme-frontend-drift-cause-test"
            "Owner"     = "acme demo org"
            "Terraform" = "true"
            "Test"      = "new tag"
        }
!       tags_all                             = {
!           "Demo"      = "March 18" -> "April 1"
            # (4 unchanged elements hidden)
        }
!       vpc_security_group_ids               = [
-           "sg-02f4a89f8b797a3da",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

-       enclave_options {
-           enabled = false -> null
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/sda1" -> null
-           encrypted             = false -> null
-           iops                  = 100 -> null
-           tags                  = {} -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-0c277c1c503b04a75" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   instances  = [
-       "i-0cd07d46b3d86081f",
+       (known after apply),
    ]
!   private_ip = [
-       "172.32.21.113",
+       (known after apply),
    ]
!   public_ip  = [
-       "54.200.121.69",
+       (known after apply),
    ]
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/695bce46-194c-4fc2-a42c-a40f61474310/environments/6fe34b40-ef49-45c9-9e43-1331c080fa19/deployments/2e1d9dcc-6466-49f1-87b7-574e777f2d1c)
